### 1. Write a simple shell script to display "Hello, World!" on the terminal. 

Command: `echo "Hello, World!"`

### 2. Write a shell script to accept user input and display it.

1. First create an empty file with `.sh` extension, by writing `nano ques2.sh`.
2. Enter the commands:<br>
`echo "Provide Input"`<br>
`read userInput`<br>
`echo "Output: $userInput"`<br>
3. Save by `CTRL + X`, then press `Y` and then `Enter`
4. Provide excecuting permission by `chmod +x ques2.sh`
5. Run the file by typing `./ques2.sh`

### 3. Write a shell script to demonstrate the use of variables. 

1. First create an empty file with `.sh` extension, by writing `nano ques3.sh`.
2. Enter the commands:<br>
`greeting="Hello"`<br>
`name="Sarim"`<br>
`echo "$greeting, $name!"`<br>
3. Save by `CTRL + X`, then press `Y` and then `Enter`
4. Provide excecuting permission by `chmod +x ques3.sh`
6. Run the file by typing `./ques3.sh`

### 4. Write a shell script to perform basic arithmetic operations.

1. First create an empty file with `.sh` extension, by writing `nano ques4.sh`.
2. Enter the commands:<br>

`echo "Enter first number:"`<br>
`read num1`<br>
`echo "Enter second number:"`<br>
`read num2`<br>

`sum=$((num1 + num2))`<br>
`diff=$((num1 - num2))`<br>
`prod=$((num1 * num2))`<br>

`if [ $num2 -ne 0 ]; then`<br>
`    quot=$((num1 / num2))`<br>
`else`<br>
`    quot="undefined (division by zero)"`<br>
`fi`<br>

`echo "Sum: $sum"`<br>
`echo "Difference: $diff"`<br>
`echo "Product: $prod"`<br>
`echo "Quotient: $quot"`<br>

3. Save by `CTRL + X`, then press `Y` and then `Enter`
4. Provide excecuting permission by `chmod +x ques4.sh`
6. Run the file by typing `./ques4.sh`

### 5. Write a program in python to find word/s having maximum number of instances in a given file and replace all its occurrences with “Aligarh”.

In [1]:
try:
    f1 = open('file1.txt', 'r+')
    content = f1.read().lower().split()
    
    freq = {}
    for word in content:
        if word not in freq:
            freq[word] = 1
        else:
            freq[word] += 1
    
    max_count = max(freq.values())
    max_words = [word for word, count in freq.items() if count == max_count]
    most_frequent_word = max_words[0] 
    
    print(f"Word(s) with max occurrences: {max_words}, Count: {max_count}")
    
    new_content = ' '.join([w.replace(most_frequent_word, "Aligarh") for w in content])
    
    f1.seek(0)
    f1.write(new_content)
    f1.truncate()
except Exception as e:
    print('An error has occurred:', e)
finally:
    f1.close()

Word(s) with max occurrences: ['apple'], Count: 10

### 6. Consider two files that contain information about Employees and Departments in the following parameters: Employee (Name, EId, Salary, DID), Department (DID, DName, DLocation). Write a Python program to merge the content of both the file in following format.: Emp_Dep(Ename, Eid, Esalary, EDID, DName,Dlocation) (Note: Merging should follow the condition-DID of Employee file should be equal to Department ID of department file)

In [2]:
import pandas as pd

In [3]:
df1 = pd.read_csv("Departments.csv")
df1.head()

   DID      DName      DLocation
0    1      Sales       New York
1    2  Marketing        Chicago
2    3         IT  San Francisco

In [5]:
df2 = pd.read_csv("Employees.csv")
df2.head()

          Name  EId  Salary  DID
0     John Doe    1   50000    1
1   Jane Smith    2   60000    1
2  Bob Johnson    3   70000    2
3  Alice Brown    4   55000    1
4   Mike Davis    5   65000    3

In [7]:
merged_df = pd.merge(df2, df1, on='DID')
merged_df.head()

          Name  EId  Salary  DID      DName      DLocation
0     John Doe    1   50000    1      Sales       New York
1   Jane Smith    2   60000    1      Sales       New York
2  Bob Johnson    3   70000    2  Marketing        Chicago
3  Alice Brown    4   55000    1      Sales       New York
4   Mike Davis    5   65000    3         IT  San Francisco

In [9]:
merged_df.to_csv('emp_dep.csv', index=False)